<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Astropad and creates a package.</string>
	<key>Identifier</key>
	<string>com.agraeff.pkg.Astropad</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.astro-hq.AstropadMac</string>
		<key>NAME</key>
		<string>Astropad</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.agraeff.download.Astropad</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                  <!--  <key>chown</key>
                   <array>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>/Astropad/Astropad.app</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                    </array>-->
                    <key>id</key>
                    <string>%BUNDLE_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
