<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Comment</key>
        <string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
        <key>Description</key>
        <string>Downloads the latest version of Astropad and creates a package.</string>
        <key>Identifier</key>
        <string>com.agraeff.pkg.Astropad</string>
        <key>Input</key>
        <dict>
            <key>BUNDLE_ID</key>
            <string>com.astro-hq.AstropadMac</string>
            <key>NAME</key>
            <string>Astropad</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.agraeff.download.Astropad</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>app_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Astropad.app</string>
                </dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
            </dict>
        </array>
    </dict>
</plist>
